Revit 2026 API

# PolymeshTopology Properties

---

The PolymeshTopology type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DistributionOfNormals | Indicates the distribution of normal vectors along the tessellated polymesh surface. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NumberOfFacets | The number of facet in the polymesh. |
|  | NumberOfNormals | The number of normals associated with the polymesh |
|  | NumberOfPoints | The number of points in the polymesh |
|  | NumberOfUVs | The number of UV coordinates available for the polymesh. |

#### Reference

PolymeshTopology Class

Autodesk.Revit.DB Namespace